Pandas is a python library whuch provides easy-to-use data structures such as Data Frame, series, and Panel for Data Analysis tools for Python Programming language. Pandas dataframes consist of main components, data, columns, rows. 

<br>
<b> Basic Operations that can be applied on a pandas Data Frame are:</b><br>
    1. Creating a Data Frame<br>
    2. Performing Operations on Data<br>
    3. Dataselection, addition, deletion<br>
    4. Working with missing data<br>
    5. Renaming, the columns or indices of a Data Frame

<b> 1. Creating a Data Frame</b>

In [45]:
#importing the pandas library
import pandas as pd

#Dictionary of key pair values called data
data={'Name':['Jan','Sam','Tom','Sia'], 'Age':[21,24,20,27]}

In [46]:
print(data)

{'Name': ['Jan', 'Sam', 'Tom', 'Sia'], 'Age': [21, 24, 20, 27]}

In [47]:
# Calling the pandas data frame method by passing the dictionary (data) as a parameter
df=pd.DataFrame(data)
df

  Name  Age
0  Jan   21
1  Sam   24
2  Tom   20
3  Sia   27

<b>2. Performing Operations on the Rows and Columns</b>

In [48]:
#the pandas library is imported and the data is now a DataFrame, df.
#Selecting a column
df[['Name']]

  Name
0  Jan
1  Sam
2  Tom
3  Sia

In [49]:
#Another way of representing the above Data Frame
df['Name']

0    Jan
1    Sam
2    Tom
3    Sia
Name: Name, dtype: object

In [50]:
#Selecting a row
row=df.loc[1]
row

#.loc method only takes integer values as parameters

Name    Sam
Age      24
Name: 1, dtype: object

In [51]:
row=df.iloc[2]
row

Name    Tom
Age      20
Name: 2, dtype: object

In [35]:
#Another way of calling the column on a dataframe
df.Age

0    21
1    24
2    20
3    27
Name: Age, dtype: int64

While calling single word column names we caimply use df.column_name or df['column_name']. Whereas while calling the column name with a space we can call the column only by df['column name']

<b>3. Data Selection, addition, deletion </b>

Getting, setting, and deleting columns works with the same syntax as the analogous dictionary operations

In [52]:
#Deleting data 
del df['Age']
df

  Name
0  Jan
1  Sam
2  Tom
3  Sia

In [53]:
#Data can be added using the insert function
df.insert(1,'name',df['Name'])
df

  Name name
0  Jan  Jan
1  Sam  Sam
2  Tom  Tom
3  Sia  Sia

<b>4. Working with missing data</b>

Missing data occurs multiple times while accessing big datasets. It often occurs like NaN(Not a Number), null, -1, etc. 
<br>
In order to fill the null values we can use a function ".isnull()". this method checks wether a null value is present in a dataframe or not.

In [54]:
#We'll create another dataset to demonstrate this.
import numpy as np
import pandas as pd

data={'First name':['Tom','Sam'], 'Age':[23,np.nan]}
df1=pd.DataFrame(data)
df1

  First name   Age
0        Tom  23.0
1        Sam   NaN

In [55]:
#using isnull() function 
df1.isnull()

   First name    Age
0       False  False
1       False   True

In [56]:
#To fill the missing value
df1.fillna(25)

  First name   Age
0        Tom  23.0
1        Sam  25.0

<b>5. Renaming the Columns or indices of a DataFrame </b>

In [59]:
new_col={'Name':'First Name', 'Age':'Age in Years'}

df1.rename(columns=new_col, inplace=True)
df1

  First name  Age in Years
0        Tom          23.0
1        Sam           NaN

In [63]:
#Changing the index values in the dataframe df

new_index={0:'a',
           1:'b',
           2:'c',
           3:'d'}
#rename the index
df.rename(index=new_index)

  First Name name
a        Jan  Jan
b        Sam  Sam
c        Tom  Tom
d        Sia  Sia

#### ADVANCED OPERATIONS ON DATAFRAMES

In [66]:
data2 = {'Date':['2016-03-01','2016-03-02','2016-03-01','2016-03-03','2016-03-02'],'Type':['a','b','c','a','c'],'Value':[2.1,4.5,7,3.6,5.2]}
df2=pd.DataFrame(data2)
df2

         Date Type  Value
0  2016-03-01    a    2.1
1  2016-03-02    b    4.5
2  2016-03-01    c    7.0
3  2016-03-03    a    3.6
4  2016-03-02    c    5.2

<b>Pivot</b>

In [67]:
#Spreading rows into columns
df3 = df2.pivot(index='Date',
               columns='Type',
               values='Value')

In [68]:
df3

Type          a    b    c
Date
2016-03-01  2.1  NaN  7.0
2016-03-02  NaN  4.5  5.2
2016-03-03  3.6  NaN  NaN

<b>Pivot Table </b>

In [69]:
df4 = pd.pivot_table(df2, values='Value',
                    index='Date', columns = 'Type')
df4

Type          a    b    c
Date
2016-03-01  2.1  NaN  7.0
2016-03-02  NaN  4.5  5.2
2016-03-03  3.6  NaN  NaN

<b>Stack/Unstack</b>

In [71]:
stacked = df4.stack()
stacked

Date        Type
2016-03-01  a       2.1
            c       7.0
2016-03-02  b       4.5
            c       5.2
2016-03-03  a       3.6
dtype: float64

In [72]:
stacked.unstack()

Type          a    b    c
Date
2016-03-01  2.1  NaN  7.0
2016-03-02  NaN  4.5  5.2
2016-03-03  3.6  NaN  NaN

<b>Melt </b>

In [73]:
#Gather columns into rows
pd.melt(df2,id_vars=['Date'], value_vars = ["Type","Value"],
       value_name = "Observations")

         Date variable Observations
0  2016-03-01     Type            a
1  2016-03-02     Type            b
2  2016-03-01     Type            c
3  2016-03-03     Type            a
4  2016-03-02     Type            c
5  2016-03-01    Value          2.1
6  2016-03-02    Value          4.5
7  2016-03-01    Value            7
8  2016-03-03    Value          3.6
9  2016-03-02    Value          5.2

##### Advanced Indexing

In [74]:
# SELECTING
df3.loc[:,(df3>1).any()] #selecting cols with any vals>1

Type          a    b    c
Date
2016-03-01  2.1  NaN  7.0
2016-03-02  NaN  4.5  5.2
2016-03-03  3.6  NaN  NaN

In [76]:
df3.loc[:,(df3>1).all()] #selecting cols with vals>1

Empty DataFrame
Columns: []
Index: [2016-03-01, 2016-03-02, 2016-03-03]

In [77]:
df3.loc[:,df3.isnull().any()] #selecting cols with NaN

Type          a    b    c
Date
2016-03-01  2.1  NaN  7.0
2016-03-02  NaN  4.5  5.2
2016-03-03  3.6  NaN  NaN

In [78]:
#selecting cols without NaN
df3.loc[:,df3.notnull().all()]

Empty DataFrame
Columns: []
Index: [2016-03-01, 2016-03-02, 2016-03-03]

In [80]:
#SETTING/RESETTING INDEX

df2.set_index('Type')

            Date  Value
Type
a     2016-03-01    2.1
b     2016-03-02    4.5
c     2016-03-01    7.0
a     2016-03-03    3.6
c     2016-03-02    5.2

In [81]:
df5=df2.reset_index()

In [82]:
df5

   index        Date Type  Value
0      0  2016-03-01    a    2.1
1      1  2016-03-02    b    4.5
2      2  2016-03-01    c    7.0
3      3  2016-03-03    a    3.6
4      4  2016-03-02    c    5.2

In [85]:
df2.reindex(['a','b','c','d','e'])

  Date Type  Value
a  NaN  NaN    NaN
b  NaN  NaN    NaN
c  NaN  NaN    NaN
d  NaN  NaN    NaN
e  NaN  NaN    NaN

In [87]:
dict={'Country':['Belgium','India','Brazil','France'],'Capital':['Brussels','New Delhi','Brasilia','Paris'],'Population':[112757,13045367,2053635,2983456]}
df=pd.DataFrame(dict)
df

   Country    Capital  Population
0  Belgium   Brussels      112757
1    India  New Delhi    13045367
2   Brazil   Brasilia     2053635
3   France      Paris     2983456

In [88]:
df.set_index('Country')

           Capital  Population
Country
Belgium   Brussels      112757
India    New Delhi    13045367
Brazil    Brasilia     2053635
France       Paris     2983456

In [91]:
df.reindex(range(6), method='ffill')

   Country    Capital  Population
0  Belgium   Brussels      112757
1    India  New Delhi    13045367
2   Brazil   Brasilia     2053635
3   France      Paris     2983456
4   France      Paris     2983456
5   France      Paris     2983456

In [93]:
df.reindex(range(6), method='bfill')

   Country    Capital  Population
0  Belgium   Brussels    112757.0
1    India  New Delhi  13045367.0
2   Brazil   Brasilia   2053635.0
3   France      Paris   2983456.0
4      NaN        NaN         NaN
5      NaN        NaN         NaN

In [94]:
#DUPLICATE DATA

df2.duplicated('Type')

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [95]:
df2.drop_duplicates('Type',keep='last')

         Date Type  Value
1  2016-03-02    b    4.5
3  2016-03-03    a    3.6
4  2016-03-02    c    5.2

In [99]:
df.index.duplicated()

array([False, False, False, False])

<b>Grouping Data </b>

In [100]:
# AGGREGATION
#grouping the data by date
df2.groupby(by=['Date','Type']).mean()

                 Value
Date       Type
2016-03-01 a       2.1
           c       7.0
2016-03-02 b       4.5
           c       5.2
2016-03-03 a       3.6

In [101]:
df4.groupby(level=0).sum()

Type          a    b    c
Date
2016-03-01  2.1  0.0  7.0
2016-03-02  0.0  4.5  5.2
2016-03-03  3.6  0.0  0.0

In [102]:
df4.groupby(level=0).agg({'a':lambda x:sum(x)/len(x),'b': np.sum})

              a    b
Date
2016-03-01  2.1  0.0
2016-03-02  NaN  4.5
2016-03-03  3.6  0.0

In [106]:
# TRANSFORMATION 

customSum = lambda x: (x+x%2)
df4.groupby(level=0).transform(customSum)

Type          a    b    c
Date
2016-03-01  2.2  NaN  8.0
2016-03-02  NaN  5.0  6.4
2016-03-03  5.2  NaN  NaN

<b>Missing Data</b>

In [109]:
#Drop NaN values
df2.dropna()

         Date Type  Value
0  2016-03-01    a    2.1
1  2016-03-02    b    4.5
2  2016-03-01    c    7.0
3  2016-03-03    a    3.6
4  2016-03-02    c    5.2

In [110]:
df3.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

In [111]:
#filling the missing values with mean values in df3
df3.fillna(df3.mean())

Type           a    b    c
Date
2016-03-01  2.10  4.5  7.0
2016-03-02  2.85  4.5  5.2
2016-03-03  3.60  4.5  6.1

In [112]:
df2.replace("a","f")

         Date Type  Value
0  2016-03-01    f    2.1
1  2016-03-02    b    4.5
2  2016-03-01    c    7.0
3  2016-03-03    f    3.6
4  2016-03-02    c    5.2

<b>Combining Data</b>

In [116]:
table1= {'X1':['a','b','c'], 'X2':[11,34,25]}
table2= {'X1':['a','b','d'], 'X2':[18,32,27]}

data_1=pd.DataFrame(table1)
data_2=pd.DataFrame(table2)

In [117]:
data_1

  X1  X2
0  a  11
1  b  34
2  c  25

In [118]:
data_2

  X1  X2
0  a  18
1  b  32
2  d  27

In [119]:
#MERGE DATA

pd.merge(data_1,data_2, how='left', on='X1')

  X1  X2_x  X2_y
0  a    11  18.0
1  b    34  32.0
2  c    25   NaN

In [120]:
pd.merge(data_1,data_2, how='right', on='X1')

  X1  X2_x  X2_y
0  a  11.0    18
1  b  34.0    32
2  d   NaN    27

In [121]:
pd.merge(data_1,data_2, how='inner', on='X1')

  X1  X2_x  X2_y
0  a    11    18
1  b    34    32

In [122]:
pd.merge(data_1,data_2, how='outer', on='X1')

  X1  X2_x  X2_y
0  a  11.0  18.0
1  b  34.0  32.0
2  c  25.0   NaN
3  d   NaN  27.0

In [135]:
#CONCAT 

pd.concat([data_1,data_2], keys=['X1','X2'])

     X1  X2
X1 0  a  11
   1  b  34
   2  c  25
X2 0  a  18
   1  b  32
   2  d  27

In [136]:
pd.concat([data_1,data_2], axis=1, join='inner')

  X1  X2 X1  X2
0  a  11  a  18
1  b  34  b  32
2  c  25  d  27